# NamingCategoryId2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifferenceNamingCategory..::..NamingCategoryId2 Property
AssemblyDifferenceNamingCategory Class See Also
---
Naming category id of the second assembly
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId NamingCategoryId2 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NamingCategoryId2 As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ NamingCategoryId2 {
	ElementId^ get ();
}
```

# See Also
AssemblyDifferenceNamingCategory Class
Autodesk.Revit.DB Namespace